# NoSupportKCoefficientTable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..NoSupportKCoefficientTable Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
"K Coefficient from table" is not supported on connector for the element
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoSupportKCoefficientTable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoSupportKCoefficientTable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoSupportKCoefficientTable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace